//Teacher info
var teacherData = [
    { name: "Գասպարյան Անահիտ", description: "1963թ.-ծնվել է։\n" +
            "1970-80թթ.–սովորել է Հրազդանի N3 միջնակարգ դպրոցում:\n" +
            "1980-85թթ.–սովորել է Երևանի Վ.Բրյուսովի անվան ինստիտուտի,բանասիրություն ֆակուլտետում:\n" +
            "1958-2004թթ.–աշխատել է Հրազդանի N8 միջնակրգ դպրոցում որպես ռուսաց լեզվի ուսուցիչ:\n" +
            "2007թ.-ից մինչ օրս աշխատում է Հրազդանի N1 ավագ դպրոցում:\n" +
            "Ամուսնացած է,ունի 2 դուստր:\n" +
            "anyut91@yahoo.com" },
    { name: "Գոհար Ալեքսանյան", description: "1965թ․-ծնվել է հունիսի 24-ին:\n" +
            "1972-82թթ.-սովորել է Հրազդանի N9 միջնակարգ դպրոցում:\n" +
            "1987-92թթ.-սովորել է Երևանի պետական մանկավարժական ինստիտուտի պատմության ֆակուլտետը:\n" +
            "1987թ.-95թ.-աշխատել է Հրազդանի N12 միջնակարգ դպրոցում որպես պատմության ուսուցիչ:\n" +
            "1995թ.-մինչ օրս աշխատում է Հրազդանի N1 ավագ դպրոցում որպես պատմության ուսուցիչ:\n" +
            "Ամուսնացած է,ունի 2 երեխա:\n"+
            'gohar.aleksanyan.65@mail.ru'
    },
    { name: "Անահիտ Գրիգորյան", description: "1956թ.-ծնվել է հունվարի 17-ին:\n" +
            "1963-73թթ.-սովորել է Հրազդանի N3 ռուսական միջնակարգ դպրոցը:\n" +
            "1975-80թթ.-սովորել է Բ. Բրյուսովի անվան լեզվաբանական ինստիտուտի ռուս-բանասիրություն ֆակուլտետը:\n" +
            "1977թ.-ից մինչ օրս աշխատում է Հրազդանի N1 ավագ դպրոցում:\n" +
            "2006թ.-շնորհվել է ՀՀ վաստակավոր մանկավարժի կոչում:\n" +
            "2015թ.-Ա.Ս. Պուշկինի անվան ռուսաց լեզվի ուսուցիչների միջազգային մրցույթի հաղթող:\n" +
            "2016թ.-շնորհվել է I կարգի տարակարգ:\n" +
            "anahit.grigoryan.56@mail.ru" },
    { name: "Ալեքսան Առաքելյան", description: "1971թ․-ծնվել է մայիսի 13-ին։\n" +
            "1978-88թթ.-սովորել է Հրազդանի N1 միջնակարգ դպրոցում:\n" +
            "Դոցենտ ԵՊՀ | Հավանականությունների տեսության և մաթեմատիկական վիճակագրության ամբիոն\n" +
            "Կրթություն\n" +
            "1988—93թթ.-Երևանի պետական համալսարանի մաթեմատիկայի ֆակուլտետ\n" +
            "Գիտական աստիճան-Ֆիզիկամաթեմատիկական գիտությունների թեկնածու\n" +
            "Թեմա — Անկախ պատահական մեծությունների գումարների սուպրեմումների բաշխումների\n" +
            "պոչերի կանոնավոր փոփոխումը: ԵՊՀ մասնագիտական խորհուրդ, 19.02.2002\n" +
            "1995—97թթ.-ՀՀ կառավարությանն առընթեր պետական ունեցվածքի հաշվառման և ապապետականացման վարչությունում որպես առաջատար մասնագետ\n" +
            "1997թ.-մինչև այժմ Հրազդանի թ. N1 ավագ դպրոցում մաթեմատիկայի ուսուցիչ\n" +
            "2002—09թթ. ԵՊՀ հավանականությունների տես. և մաթ. վիճակագրության ամբիոնի ասիստենտ:\n" +
            "2008—09թթ. ԵՊՀ գիտական բաժնի ավագ գիտաշխատող:\n" +
            "2009թ-ից մինչև այժմ ԵՊՀ հավանականությունների տես. և մաթ. վիճակագրության ամբիոնի դոցենտ։                 \n" +
            "Կարդացվող դասընթացներ-Հավանականությունների տեսություն և մաթեմատիկական վիճակագրություն,դիսկրետ մաթեմատիկա, զուգամիտության կայուն օրենքներ,միաչափ կայուն օրենքներ\n" +
            "Գիտական  հոդվածներ,ուսումնամեթոդական ձեռնարկներ,գրքեր և այլն։\n" +
            "Գիտական հետաքրքրությունների շրջանակը\n" +
            "Անկախ պատահական մեծությունների գումարների բաշխման պոչերի ասիմպտոտիկ վարքը, կանոնավոր փոփոխվող ֆունկցիաներ, կայուն բաշխումներ\n" +
            "Լեզուներ-Հայերեն,ռուսերեն, ֆրանսերեն, անգլերեն:\n" +
            "Պարգևներ-2006 թ. ՀՀ վարչապետի շնորհակալագիր` կրթության և գիտության ոլորտում ունեցած ներդրման համար\n" +
            "Ամուսնացած է, ունի 3 երեխա:\n" +
            "Aleksan1971@mail.ru" },
    { name: "Սարիբեկյան Գոհար ", description: "1957թ․–ծնվել է սեպտեմբերի 1-ին:\n" +
            "1964-72թթ.–սովորել է Կաքավաձոր թաղամասի N7 8-ամյա դպրոցը:\n" +
            "1972-74թթ.–սովերել է Հրազդանի N9 միջնակարգ դպրոցում:\n" +
            "1976-81թթ.–սովորել է Կիրովականի պետական մանկավարժական ինստիտուտի հայոց լեզվագրական բաժինը:\n" +
            "1974-77թթ.–աշխատել է Հրազդանի N7 ութամյա դպրոցում որպես երկարօրյա խմբի դաստիարակ:\n" +
            "1977-96թթ.–աշխատել է Հրազդանի N2 միջնակարգ դպրոցում որպես հայոց լեզվի և գրականության ուսուցիչ,եղել է ՄՄ նախագահ:\n" +
            "1996թ.–ից մինչ օրս աշխատում է Հրազդանի N1 ավագ դպրոցում որպես հայոց լեզվի և գրականության ուսուցիչ,հայոց լեզվի և գրականության ՄՄ-ի նախագահն է:\n" +
            "Ամուսնացած է,ունի 3 երեխա:\n" +
            "saribekyan.gohar57@mail.ru" },
    { name: "Դավթյան Դավիթ-տնտեսվար", description: "Ծնվել է 1960թ.-ծնվել է հուլիսի 27-ին:\n" +
            "1967-77թթ.–սովորել է Հրազդանի N1 միջնակարգ դպրոցում:\n" +
            "1978-83թթ.–սովորել է Երևանի Կ.Մաքսի անվան պոլիտեխնիկական ինստիտուտի մեքենաշինության ֆակուլտետում,ստացել է ինժեներ–մեխանիկի որակավորում:\n" +
            "1983-98թթ.–աշխատել է <<Հրազդանմաշ>> գործարանում որպես արտադրամասի պետ:\n" +
            "2003թ.-ից մինչև օրս աշխատում է Հրազդանի N 1 ավագ դպրոցում:\n" +
            "Ամուսնացած է,ունի 3 երեխա:" },
    { name: "Ստեփանյան Շողիկ–գլխավոր հաշվապահ", description: "1959թ.–ծնվել է մայիսի 2-ին:\n" +
            "1966-76թթ.–սովորել է Հրազդանի N 4 միջնակարգ դպրոցում:\n" +
            "1978-81թթ.–սովորել է Երևանի մեքենաշինական տեխնիկումում,ստացել է տեխնոլոգ-հաշվապահի որակավորում:\n" +
            "1976-79թթ.–աշխատել է Հրազդանի սպորտ դպրոցում որպես գործավար:\n" +
            "1979-83թթ.–Հրազդանի մեքենաշինական գործարանում որպես տեխնոլոգ:\n" +
            "1983-96թթ.–աշխատել է Հրազդանի քաղժողկրթբաժնում որպես հաշվապահ:\n" +
            "1996թ.-ից մինչ օրս աշխատում է Հրազդանի  N 1 ավագ դպրոցում:\n" +
            "Ամուսնացած է,ունի 3 երեխա:\n" +
            "shoxikhamo@mail.ru" },
    { name: "Հակոբյան Գոհար–հոգեբան", description: "1969թ.–ծնվել է մարտի 20-ին:\n" +
            "1975-85թթ.–սովորել է Հրազդանի Ե. Չարենցի անվան N 2 միջնակարգ դպրոցում:\n" +
            "1989-93թթ.–սովորել է Երևանի Խ.Աբովյանի անվան մանկավարժական ինստիտուտի մանկավարժության և հոգեբանության ֆակուլտետում:\n" +
            "2007թ-ից մինչ օրս աշխատում է Հրազդանի N1 ավագ դպրոցում որպես հոգեբան:\n" +
            "Ամուսնացած է, ունի 2 երեխա:" },
    { name: "Սարգսյան Գոհար–գրադարանավար", description: "1974թ․–ծնվել է մարտի 4-ին:\n" +
            "1981-91թթ.–սովորել է Հրազդանի N1 միջնակարգ դպրոցում:\n" +
            "1991-96թթ.–սովորել է Երևանի պետական համալսարանի մաթեմատիկայի ֆակուլտետում:\n" +
            "1996-2004թթ.–աշխատել է Հրազդանի N8 միջնակարգ դպրոցում որպես մաթեմատիկայի ուսուցիչ:\n" +
            "2004-06թթ.–աշխատել է ՀՀ Կոտայքի մարզպետարանում որպես առաջատար մասնագետ:\n" +
            "2007թ.-ից մինչ օրս աշխատում է Հրազդանի N1 ավագ դպրոցում որպես գրադարանավար:\n" +
            "Ամուսնացած է, ունի 2 երեխա:\n" +
            "gohars1974@rambler.ru" },
    { name: "Արփինե Հովհաննիսյան", description: "1981թ․–ծնվել է թվականի օգոստոսի 16-ին:\n" +
            "1988-98թթ.–սովորել է Հրազդանի N1 միջնակարգ դպրոցում:\n" +
            "1998-2003թթ. ԵՊՏՀ-ի համաշխարհային տնտեսագիտություն ֆակուլտետում:\n" +
            "2004-08թթ սովորել է ԵՊՄՀ-ի պատմության ֆակուլտետում:\n" +
            "2011-ից մինչ օրս աշխատում է Հրազդանի N1 ավագ դպրոցում որպես հասարակագիտության ուսուցչուհի:\n" +
            "2018թ. շնորհվել է I կարգի տարակարգ:\n" +
            "arpihovhannisyan81@gmail.com" },
    { name: "Հարությունյան Հասմիկ ", description: "Ծնվել է 1956թ.–ծնվել է մայիսի 5-ին:\n" +
            "1975-1981թթ.–սովորել է Երևանի պետական համալսարանի բանասիրության ֆակուլտետում:\n" +
            "1981–96թթ. աշխատել է Հրազդանի N3 միջնակարգ ռուսական դպրոցում որպես հայոց լեզվի և գրականության ուսուցիչ:\n" +
            "1996թ.-ից մինչև օրս աշխատում է Հրազդանի N1 ավագ դպրոցում:\n" +
            "Ամուսնացած է,ունի 2 երեխա:" },
    { name: "Արման Գրիգորյան", description: "1997թ․-ծնվել է դեկտեմբերի 17-ին։\n" +
            "սովորել է Սոլակի միջնակարգ դպրոցում։\n" +
            "2015-2021թթ․-Հայաստանի ֆիզիկական կուլտուրայի և սպորտի պետական ինստիտուտ։ \n" +
            "2021թ․-Սոլակի միջնակարգ դպրոց։  \n" +
            "2023թ․-Հրազդանի N1 հիմնական դպրոց։\n" +
            "arman_grigoryan97@mail.ru" },


];

function generateTeacherBlocks(data) {
    var blocksHTML = "";
    data.forEach(function(teacher) {
        blocksHTML += `<div class="teacher-block">
                            <h2>${teacher.name}</h2>
                            <p>${teacher.description}</p>
                       </div>`;
    });
    return blocksHTML;
}

var container = document.getElementById("teacherBlocksContainer");
container.innerHTML = generateTeacherBlocks(teacherData);
