@extends('layouts.app')
@section('content')
    <div class="his">
        <div class="his_title">
            <div class="line" id="line1"></div>
            <div class="his_title_text">Դպրոցի պատմություն</div>
            <div class="line" id="line2"></div>
        </div>
        <div class="his_img"></div>
        <div class="his_text"> Դպրոցի անվանումը- ՀՀ Կոտայքի մարզի, ք. Հրազդանի Խ. Աբովյանի անվան թիվ 1 ավագ դպրոց
             Փոստային դասիչ- 2306
             հիմնադրվել է- 1902թ
             2002թ-Պարգևատրվել է ՀՀ ԿԳՆ հուշամեդալով
             2009թ-ին ստացել է ավագ դպրոցի կարգավիճակ,
             2018թ.-ԱԲ-ի թեկնածու դպրոց
             2021թ. «Գյուղական համայնքներում բացակա ուսուցիչների խնդրի լուծումը էլեկտրոնային դասավանդման
            միջոցով» ծրագիր իրականացնող դպրոց
             2021թ-Հանրակրթական ուսումնական հաստատության հերթական ատեստավորման ենթակա ուսուցիչների
            վերապատրաստման դասընթաց /ՀՀ ԿԳՄՍՆ, «Հրազդանի Խ.Աբովյանի անվ. թիվ 1 ավագ դպրոց» ՊՈԱԿ/
             2021 թ.-ից ամառային դպրոց
             2021թ. հանդիսանում է ուսումնական հաստատության ղեկավարման իրավունք «հավաստագիր» ստանալու
            համար վերապատրաստող կազմակերպություն
             2022թ. իրականացրել է տնօրենների, տնօրենների ուսումնական գծով տեղակալների վերապատրաստում
            ԿԶՆԱԿ-ի կողմից
             2018թ-ից &lt;&lt;Միասնական Հրազդան&gt;&gt; ՀԿ-ի հետ համագործակցում է
             2021-22 &lt;&lt;Գիտոեւթյան փառատոն &gt;&gt;մրցանակաբաշխությունում &lt;&lt;Լավագույն մրցանակ&gt;&gt;
             Yang-ԲՏՃՄ հագեցած լաբորատորիաներ</div>
    </div>
@endsection
